#### Pandas - Pandas Series & DataFrame

In [2]:
## Importing Pandas
import pandas as pd

In [ ]:
## Pandas Series
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
## Creating a Series from a dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [ ]:
## Giving our desired index/index_name to a series
data=[10,20,30, 50]
series_result = pd.Series(data, index=['math', 'science', 'english', 'econs'])
print(series_result)


## There's another way to achieve just this. See Below:

math       10
science    20
english    30
econs      50
dtype: int64

In [11]:
## The second method
data2=[30,26,70,78]
index=['math2', 'science2', 'english2', 'econs2']
pd.Series(data2, index=index)

math2       30
science2    26
english2    70
econs2      78
dtype: int64

In [ ]:
## Dataframe
## create a Dataframe from a dictionary of list

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [ ]:
## Creating a Data frame From a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [ ]:
### Reading a csv dataset
df = pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [9]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [ ]:
### Accessing Data From Dataframe
data3=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
]
df=pd.DataFrame(data3)
print(df)

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [ ]:
df['Name']  ## to retrieve a single column from the datframe. This column becomes a series

0    Krish
1     John
2    Bappy
3     JAck
Name: Name, dtype: object

In [19]:
df.loc[0]       ## to look at the record of rows in the dataframe. In this case, row at index '0'

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [20]:
df.iloc[0]       ## to look at the record of columns in the dataframe. In this case, column at index '0'

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [25]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [29]:
print(df.at[2,'Age'])

32

In [30]:
## Accessing a specified element using iat
print(df.iat[2,2])

Bangalore

In [31]:
### Data MAnipulation with Dataframe
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [37]:
## Adding a column
df['Salary']=[50000,60000,70000,80000]
print(df)

    Name  Age       City  Salary
0  Krish   32  Bangalore   50000
1   John   34  Bangalore   60000
2  Bappy   32  Bangalore   70000
3   JAck   32  Bangalore   80000

In [ ]:
## Removing a column
df.drop('Salary',axis=1,inplace=True)
'''
 'axis' specifies row/column where what we want to delete/remove is located, where row is '0', column is '1'
 'inplace=True' permanently removes the record(s) from the dataframe; Otherwise it'll still be there
'''
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [39]:
## Add age to the column
df['Age']=df['Age']+1
df

    Name  Age       City
0  Krish   33  Bangalore
1   John   35  Bangalore
2  Bappy   33  Bangalore
3   JAck   33  Bangalore

In [43]:
## removing a row
df.drop(1,inplace=True)
df

    Name  Age       City
2  Bappy   33  Bangalore
3   JAck   33  Bangalore

In [44]:
df=pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [45]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object
Statistical summary:
            Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [46]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000